In [22]:
import pandas as pd
import numpy as np

### Series 对象基础

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values, obj.index

(array([ 4,  7, -5,  3]), RangeIndex(start=0, stop=4, step=1))

In [4]:
obj_2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj_2

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
obj_2['b']

7

In [6]:
obj_2[['a', 'c']]

a   -5
c    3
dtype: int64

In [7]:
obj_2[obj_2 > 0]

d    4
b    7
c    3
dtype: int64

In [8]:
obj_2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [9]:
'b' in obj_2, 'e' in obj_2

(True, False)

In [10]:
# Dict to Series
sdata = {'Wuhan': '027', 'Beijing': '010', 'Hangzhou': '0571'}
obj_3 = pd.Series(sdata)
obj_3  # sort alphabetly

Beijing      010
Hangzhou    0571
Wuhan        027
dtype: object

In [11]:
cities = ['Wuhan', 'Hangzhou', 'Beijing', 'Shanghai']
obj_4 = pd.Series(sdata, index = cities)
obj_4  # sort by index

Wuhan        027
Hangzhou    0571
Beijing      010
Shanghai     NaN
dtype: object

In [12]:
obj_4.isnull()

Wuhan       False
Hangzhou    False
Beijing     False
Shanghai     True
dtype: bool

In [13]:
obj_3 + obj_4  # Series will align elements automatically

Beijing       010010
Hangzhou    05710571
Shanghai         NaN
Wuhan         027027
dtype: object

In [14]:
obj_4.name = 'area code'
obj_4.index.name = 'city'
obj_4

city
Wuhan        027
Hangzhou    0571
Beijing      010
Shanghai     NaN
Name: area code, dtype: object

In [15]:
obj.index = ['Tom', 'Jerry', 'Lily', 'Lucy']
obj

Tom      4
Jerry    7
Lily    -5
Lucy     3
dtype: int64

### loc_iloc_ix

In [16]:
data = [[1,2,3],[4,5,6]]  
index = ['d','e']  
columns=['a','b','c']  
df = pd.DataFrame(data=data, index=index, columns=columns)

In [17]:
df

   a  b  c
d  1  2  3
e  4  5  6

In [18]:
df.loc['d']  # loc accept what type the index is

a    1
b    2
c    3
Name: d, dtype: int64

In [19]:
df.iloc[0]  # iloc only accept int as index number

a    1
b    2
c    3
Name: d, dtype: int64

In [20]:
df.ix['d']  # ix accept any type of index, but not recommanded to use

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

a    1
b    2
c    3
Name: d, dtype: int64

In [21]:
df.ix[0]

a    1
b    2
c    3
Name: d, dtype: int64

### DataFrame基础

In [23]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [24]:
frame_2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                       index = ['one', 'two', 'three', 'four', 'five'])
frame_2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [25]:
frame_2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [26]:
frame_2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [27]:
frame_2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [28]:
frame_2['debt'] = np.arange(5)
frame_2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [29]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame_2['debt'] = val
frame_2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [30]:
frame_2['eastern'] = frame_2['state'] == 'Ohio'
frame_2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [31]:
del frame_2['eastern']
frame_2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [32]:
frame_2.T

        one   two three    four    five
year   2000  2001  2002    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9
debt    NaN  -1.2   NaN    -1.5    -1.7

In [33]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame_3 = pd.DataFrame(pop)
frame_3.index.name = 'year'
frame_3.columns.name = 'state'
frame_3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [34]:
frame_2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [35]:
frame_2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [36]:
frame.index

RangeIndex(start=0, stop=5, step=1)

### reindex

In [37]:
obj = pd.Series([4.5, 6.2, 9.1, 8.8], index = ['d', 'c', 'a', 'b'])
obj

d    4.5
c    6.2
a    9.1
b    8.8
dtype: float64

In [38]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a    9.1
b    8.8
c    6.2
d    4.5
e    0.0
dtype: float64

In [39]:
obj_2 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj_2.reindex(range(6), method = 'ffill')
# ffill - fill values forward
# bfill - fill values backward

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [40]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                     index = ['a', 'c', 'd'], 
                     columns = ['Wuhan', 'Beijing', 'Guangzhou'])
frame

   Wuhan  Beijing  Guangzhou
a      0        1          2
c      3        4          5
d      6        7          8

In [41]:
frame.reindex(['a', 'b', 'c', 'd'], method = 'bfill')

   Wuhan  Beijing  Guangzhou
a      0        1          2
b      3        4          5
c      3        4          5
d      6        7          8

In [42]:
frame.reindex(columns = ['Wuhan', 'Guangzhou', 'Beijing', 'Hangzhou'])

   Wuhan  Guangzhou  Beijing  Hangzhou
a      0          2        1       NaN
c      3          5        4       NaN
d      6          8        7       NaN

### drop

In [43]:
obj.drop('c')  # drop entries without modifying the original data

d    4.5
a    9.1
b    8.8
dtype: float64

In [44]:
frame.drop('c')  # DataFrame drop

   Wuhan  Beijing  Guangzhou
a      0        1          2
d      6        7          8

In [45]:
frame.drop(['Beijing', 'Guangzhou'], axis = 1)

   Wuhan
a      0
c      3
d      6

### indexing, selection, filtering

In [46]:
frame_2 = frame.reindex(['a', 'b', 'c', 'd'], 
                        columns = ['Wuhan', 'Beijing', 'Guangzhou', 'Hangzhou'], 
                        fill_value = 0)
frame_2

   Wuhan  Beijing  Guangzhou  Hangzhou
a      0        1          2         0
b      0        0          0         0
c      3        4          5         0
d      6        7          8         0

In [47]:
frame_2[['Wuhan', 'Beijing']]

   Wuhan  Beijing
a      0        1
b      0        0
c      3        4
d      6        7

In [48]:
frame_2.loc[['a', 'b']]

   Wuhan  Beijing  Guangzhou  Hangzhou
a      0        1          2         0
b      0        0          0         0

In [49]:
frame_2.iloc[:2]

   Wuhan  Beijing  Guangzhou  Hangzhou
a      0        1          2         0
b      0        0          0         0

In [50]:
frame_2[frame_2['Wuhan'] == 0]

   Wuhan  Beijing  Guangzhou  Hangzhou
a      0        1          2         0
b      0        0          0         0

In [51]:
frame_2[frame_2 == 0] = 9
frame_2

   Wuhan  Beijing  Guangzhou  Hangzhou
a      9        1          2         9
b      9        9          9         9
c      3        4          5         9
d      6        7          8         9

In [52]:
frame_2.loc[:'b', ['Wuhan', 'Beijing']]

   Wuhan  Beijing
a      9        1
b      9        9

### axis indexes with duplicate values

In [53]:
obj_3 = pd.Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj_3.index.is_unique

False

In [54]:
obj_3['a']

a    0
a    1
dtype: int64

### function application and mapping

In [55]:
frame_4 = pd.DataFrame(np.random.randn(4, 3), 
                       columns = list('bde'), 
                       index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
frame_4

               b         d         e
Utah   -0.901171  0.785801 -0.291279
Ohio    0.677119 -0.066513  0.863753
Texas  -0.169443 -0.263737  1.203754
Oregon -1.625184 -0.115218  1.759806

In [56]:
np.abs(frame_4)

               b         d         e
Utah    0.901171  0.785801  0.291279
Ohio    0.677119  0.066513  0.863753
Texas   0.169443  0.263737  1.203754
Oregon  1.625184  0.115218  1.759806

In [57]:
f = lambda x: x.max() - x.min()
frame_4.apply(f)

b    2.302303
d    1.049538
e    2.051084
dtype: float64

In [58]:
frame_4.apply(f, axis = 1)  # apply with be applied to columns or indexes

Utah      1.686972
Ohio      0.930266
Texas     1.467490
Oregon    3.384990
dtype: float64

In [59]:
format = lambda x: '%.2f' % x
frame_4.applymap(format)  # applymap with be applied to every elements

            b      d      e
Utah    -0.90   0.79  -0.29
Ohio     0.68  -0.07   0.86
Texas   -0.17  -0.26   1.20
Oregon  -1.63  -0.12   1.76

### sorting and ranking

In [60]:
# sort_index(), sort indexes in Series and DataFrames
# order(), sort values in Series
# rank(), return values' rank

### summarizing and computing descriptive statistics

In [61]:
frame_3 = pd.DataFrame([[1.4, np.nan], 
                        [7.1, -4.5], 
                        [np.nan, np.nan], 
                        [0.75, -1.3]], 
                       index = ['a', 'b', 'c', 'd'], columns = ['one', 'two'])
frame_3

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [62]:
frame_3.sum()

one    9.25
two   -5.80
dtype: float64

In [63]:
frame_3.sum(axis = 1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [64]:
frame_3.mean(axis = 1, skipna = False)  # (1.4 + NaN) / 2 = NaN

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [65]:
frame_3.mean(axis = 1)  # 1.4 / 1 = 1.4

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [66]:
frame_3.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [67]:
frame_3.describe()  # incredibly useful in ProbStat

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [68]:
obj_4 = pd.Series(['a', 'a', 'c', 'd'] * 4)
obj_4

0     a
1     a
2     c
3     d
4     a
5     a
6     c
7     d
8     a
9     a
10    c
11    d
12    a
13    a
14    c
15    d
dtype: object

In [69]:
obj_4.describe()  # describle for non-numeric datas

count     16
unique     3
top        a
freq       8
dtype: object

### correlation and covariance

In [73]:
import pandas_datareader.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'AMZN']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [74]:
returns = price.pct_change()
returns.tail()

                AAPL      AMZN       IBM      MSFT
Date
2009-12-24  0.034340 -0.003383  0.004384  0.002587
2009-12-28  0.012294  0.006066  0.013326  0.005484
2009-12-29 -0.011861  0.000718 -0.003476  0.007058
2009-12-30  0.012147 -0.020945  0.005461 -0.013699
2009-12-31 -0.004300 -0.014433 -0.012597 -0.015504

In [75]:
returns.MSFT.corr(returns.IBM)  # calculate correlation of two specific columns

0.49597998830637019

In [76]:
returns.MSFT.cov(returns.IBM)  # calculate covariance of two specific columns

0.00021595765151738138

In [77]:
# corrwith

### unique values, value counts, and membership

In [79]:
obj = pd.Series(['c', 'd', 'c', 'a', 'b', 'd', 'c', 'a', 'a', 'd'])
uniques = obj.unique()
uniques

array(['c', 'd', 'a', 'b'], dtype=object)

In [82]:
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [83]:
obj.value_counts()

c    3
d    3
a    3
b    1
dtype: int64

In [84]:
obj.isin(['b', 'c'])

0     True
1    False
2     True
3    False
4     True
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [85]:
obj[obj.isin(['b', 'c'])]

0    c
2    c
4    b
6    c
dtype: object

In [86]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4], 
                     'Qu2': [2, 3, 1, 2, 3], 
                     'Qu3': [1 ,5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [87]:
result = data.apply(pd.value_counts).fillna(0)  # count values of every column
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### handling missing data

In [88]:
string_data = pd.Series([None, 'Heart', np.nan, 'Club', 'Diamond', 'Spade'])
string_data.isnull()  # both None and NaN are null

0     True
1    False
2     True
3    False
4    False
5    False
dtype: bool

### filtering out missing data

In [90]:
string_data.dropna()  # same as string_data[string_data.notnull()]

1      Heart
3       Club
4    Diamond
5      Spade
dtype: object

In [91]:
data = pd.DataFrame([[1., 6.5, 3.], 
                     [1., np.nan, 9.], 
                     [np.nan, np.nan, np.nan], 
                     [31., 6.2, np.nan]])
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [92]:
data.dropna(how = 'all')

      0    1    2
0   1.0  6.5  3.0
1   1.0  NaN  9.0
3  31.0  6.2  NaN

In [93]:
data[4] = np.nan
data

      0    1    2   4
0   1.0  6.5  3.0 NaN
1   1.0  NaN  9.0 NaN
2   NaN  NaN  NaN NaN
3  31.0  6.2  NaN NaN

In [94]:
data.dropna(axis = 1, how = 'all')

      0    1    2
0   1.0  6.5  3.0
1   1.0  NaN  9.0
2   NaN  NaN  NaN
3  31.0  6.2  NaN

In [95]:
df = pd.DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = np.nan
df.loc[:2, 2] = np.nan
df

          0         1         2
0 -1.393483       NaN       NaN
1 -0.430153       NaN       NaN
2 -0.229647       NaN       NaN
3 -0.865837       NaN -0.868138
4 -0.711555       NaN  1.595363
5 -0.785642  0.139857  0.099520
6 -0.565755 -0.270392  0.151718

In [96]:
df.dropna(thresh = 2)  # contain more than 2 numbers

          0         1         2
3 -0.865837       NaN -0.868138
4 -0.711555       NaN  1.595363
5 -0.785642  0.139857  0.099520
6 -0.565755 -0.270392  0.151718

### filling in missing data

In [97]:
df.fillna(0)

          0         1         2
0 -1.393483  0.000000  0.000000
1 -0.430153  0.000000  0.000000
2 -0.229647  0.000000  0.000000
3 -0.865837  0.000000 -0.868138
4 -0.711555  0.000000  1.595363
5 -0.785642  0.139857  0.099520
6 -0.565755 -0.270392  0.151718

In [98]:
df.fillna({1: 9, 2: 2})

          0         1         2
0 -1.393483  9.000000  2.000000
1 -0.430153  9.000000  2.000000
2 -0.229647  9.000000  2.000000
3 -0.865837  9.000000 -0.868138
4 -0.711555  9.000000  1.595363
5 -0.785642  0.139857  0.099520
6 -0.565755 -0.270392  0.151718

In [99]:
df_2 = pd.DataFrame(np.random.randn(6, 3))
df_2.loc[2:, 1] = np.nan
df_2.loc[4:, 2] = np.nan
df_2

          0         1         2
0  1.223345  1.044651 -0.010761
1 -0.008653 -0.148645 -0.483069
2 -1.157934       NaN  2.641815
3  0.915920       NaN -2.408308
4 -0.510334       NaN       NaN
5  0.101238       NaN       NaN

In [100]:
df_2.fillna(method = 'ffill', limit = 1)

          0         1         2
0  1.223345  1.044651 -0.010761
1 -0.008653 -0.148645 -0.483069
2 -1.157934 -0.148645  2.641815
3  0.915920       NaN -2.408308
4 -0.510334       NaN -2.408308
5  0.101238       NaN       NaN

### hierarchical indexing

In [101]:
frame = pd.DataFrame({'a': range(7), 
                      'b': range(7, 0, -1), 
                      'c': ['one', 'one', 'one', 'two', 'two', 'three', 'three'], 
                      'd': [0, 1, 2, 0, 1, 0, 1]})
frame

   a  b      c  d
0  0  7    one  0
1  1  6    one  1
2  2  5    one  2
3  3  4    two  0
4  4  3    two  1
5  5  2  three  0
6  6  1  three  1

In [102]:
frame_2 = frame.set_index(['c', 'd'])
frame_2

         a  b
c     d
one   0  0  7
      1  1  6
      2  2  5
two   0  3  4
      1  4  3
three 0  5  2
      1  6  1

In [103]:
frame_2.reset_index().reindex(columns = ['a', 'b','c', 'd'])

   a  b      c  d
0  0  7    one  0
1  1  6    one  1
2  2  5    one  2
3  3  4    two  0
4  4  3    two  1
5  5  2  three  0
6  6  1  three  1

### database-style DataFrame merges

In [104]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'a', 'c', 'c', 'b'], 'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})
df1.reindex(columns = ['key', 'data1'])

  key  data1
0   b      0
1   b      1
2   a      2
3   a      3
4   c      4
5   c      5
6   b      6

In [105]:
df2.reindex(columns = ['key', 'data2'])

  key  data2
0   a      0
1   b      1
2   d      2

In [106]:
pd.merge(df1, df2, on = 'key', how = 'outer')  
# use left_on & right_on to choose columns to join on when the columns' name is different.
# when merging on index, use left_index/right_index = True.

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    3.0   a    0.0
5    4.0   c    NaN
6    5.0   c    NaN
7    NaN   d    2.0

### concatenating along an axis

In [107]:
s1 = pd.Series([0, 1], index = ['a', 'b'])
s2 = pd.Series([2, 3, 4], index = ['c', 'd', 'e'])
s3 = pd.Series([5, 6, 7, 8], index = ['f', 'g', 'h', 'i'])
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
dtype: int64

In [108]:
pd.concat([s1, s2, s3], axis = 1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0
h  NaN  NaN  7.0
i  NaN  NaN  8.0

In [109]:
s4 = s1 * 5
s4

a    0
b    5
dtype: int64

In [110]:
s5 = pd.concat([s3, s4])
s5

f    5
g    6
h    7
i    8
a    0
b    5
dtype: int64

In [111]:
pd.concat([s1, s5], axis = 1, join = 'inner')

   0  1
a  0  0
b  1  5

In [112]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns = ['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns = ['a', 'b', 'd'])
df1

          a         b         c         d
0  0.998332  0.499340 -0.088937 -0.031916
1  1.397514 -2.463550  0.790657 -0.122204
2 -0.494241 -1.924443  1.261924 -0.292673

In [113]:
df2

          a         b         d
0  0.400443  0.303779  0.482670
1 -0.767397 -0.085480 -0.218908

In [114]:
pd.concat([df1, df2])

          a         b         c         d
0  0.998332  0.499340 -0.088937 -0.031916
1  1.397514 -2.463550  0.790657 -0.122204
2 -0.494241 -1.924443  1.261924 -0.292673
0  0.400443  0.303779       NaN  0.482670
1 -0.767397 -0.085480       NaN -0.218908

In [115]:
pd.concat([df1, df2], ignore_index = True)

          a         b         c         d
0  0.998332  0.499340 -0.088937 -0.031916
1  1.397514 -2.463550  0.790657 -0.122204
2 -0.494241 -1.924443  1.261924 -0.292673
3  0.400443  0.303779       NaN  0.482670
4 -0.767397 -0.085480       NaN -0.218908

### combining data with overlap

In [116]:
df3 = pd.DataFrame({'a': [1, np.nan, 5, np.nan], 
                    'b': [np.nan, 2, np.nan, 6], 
                    'c': range(2, 18, 4)})
df3

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [117]:
df4 = pd.DataFrame({'a': [5, 4, np.nan, 3, 7], 
                    'b': [np.nan, 3, 4, 6, 8]})
df4

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [118]:
df3.combine_first(df4)  
# use non-null values first when there is a null value
# use df3 first when both of them have values

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

### reshaping and pivoting

In [119]:
## nothing here for now

### removing duplicates

In [120]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 
                     'k2': [1, 1, 2, 2, 3, 3, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   2
4  two   3
5  two   3
6  two   4

In [121]:
data.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [122]:
data.drop_duplicates()  # consider all columns if they are all duplicates

    k1  k2
0  one   1
2  one   2
3  two   2
4  two   3
6  two   4

In [123]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   2   3
4  two   3   4
5  two   3   5
6  two   4   6

In [124]:
data.drop_duplicates(['k1'])  # consider one column

    k1  k2  v1
0  one   1   0
3  two   2   3

In [125]:
data.drop_duplicates(['k1', 'k2'])  # consider two columns

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   2   3
4  two   3   4
6  two   4   6

In [126]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
1  one   1   1
2  one   2   2
3  two   2   3
5  two   3   5
6  two   4   6

### transforming data using a function or mapping

In [127]:
data_1 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 
                             'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data_1

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [128]:
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 
                  'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

data_1['animal'] = data_1['food'].map(str.lower).map(meat_to_animal)
# or data['food'].map(lambda x: meat_to_animal[x.lower()])

data_1

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### replacing values

In [129]:
data_3 = pd.Series([1., -999., 2., -999., -1000., 3.])

In [130]:
data_3

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [131]:
data_3.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [132]:
data_3.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [133]:
data_3.replace({-999: np.nan, -1000: 1})

0    1.0
1    NaN
2    2.0
3    NaN
4    1.0
5    3.0
dtype: float64

### renaming axis indexes

In [134]:
data_4 = pd.DataFrame(np.arange(12).reshape(3, 4), 
                      index = ['Ohio', 'Colorado', 'New York'], 
                      columns = ['one', 'two', 'three', 'four'])
data_4

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [135]:
data_4.index = data_4.index.map(str.upper)
data_4

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [136]:
data_4.rename(index = {'OHIO': 'INDIANA'}, columns = {'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [137]:
data_4.rename(index = str.title, columns = str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [138]:
data_4  # because inplace is False in default, rename didn't modify the original df

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

### discretization and binning

In [139]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [140]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [141]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [142]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [143]:
pd.cut(ages, bins, right = False)  # include left but right

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [144]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [MiddleAged < Senior < YoungAdult < Youth]

In [145]:
data_5 = np.random.rand(20)
data_5

array([ 0.23432072,  0.41098749,  0.8800826 ,  0.05864172,  0.87293925,
        0.33476944,  0.13310211,  0.72750896,  0.0933043 ,  0.85985838,
        0.07006389,  0.19478094,  0.59816709,  0.01352078,  0.21293828,
        0.17991652,  0.475364  ,  0.57187369,  0.5856378 ,  0.24728156])

In [146]:
pd.cut(data_5, 4, precision = 2)

[(0.23, 0.45], (0.23, 0.45], (0.66, 0.88], (0.013, 0.23], (0.66, 0.88], ..., (0.013, 0.23], (0.45, 0.66], (0.45, 0.66], (0.45, 0.66], (0.23, 0.45]]
Length: 20
Categories (4, interval[float64]): [(0.013, 0.23] < (0.23, 0.45] < (0.45, 0.66] < (0.66, 0.88]]

### detecting and filtering outliers

In [147]:
data_6 = pd.DataFrame(np.random.randn(1000, 4))
data_6.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.035469    -0.005346    -0.015865     0.040835
std       1.025410     0.987828     1.028278     0.944030
min      -3.195763    -3.298217    -2.870921    -3.540662
25%      -0.672885    -0.674888    -0.727261    -0.635992
50%       0.007492     0.012671    -0.048468     0.048677
75%       0.655191     0.627413     0.667138     0.706424
max       3.500183     3.027599     3.170638     2.811101

In [148]:
col = data_6[3]
col[np.abs(col) > 2.5]

134   -3.540662
241   -3.268723
288    2.651320
450    2.811101
923    2.598179
Name: 3, dtype: float64

In [149]:
data_6[(np.abs(data_6) > 3).any(1)]

            0         1         2         3
119 -0.059932  0.174931  3.032718  0.070621
134  0.323408 -2.170138  0.657404 -3.540662
168  0.035402  3.027599  0.214698  0.301755
210 -3.195763 -1.791161  0.135846 -1.269471
237  3.500183 -0.519934  0.262676  0.122729
241  0.368291  0.241228  0.731652 -3.268723
248  1.064575 -0.217401  3.143614 -0.760669
254  3.080901  0.194601 -1.924190 -0.279565
289 -3.099304 -0.112170 -1.146850 -0.465729
468  1.678719 -1.255173  3.170638 -0.762480
544  0.476484  0.053789  3.107212  1.845271
581 -3.154732  0.377658 -0.047857 -0.890069
672 -3.045627 -0.274044  0.065128  0.193805
763  0.470673 -3.241875 -1.160372  0.384748
812 -0.512483 -3.298217 -1.403461  0.419807
886  3.037232 -0.906777 -1.908976  1.996595

### permutation and random sampling

In [150]:
## nothing for now

### computing indicator/dummy variables

In [151]:
## nothing for now

### string object methods

In [152]:
val = 'a,b, c'
val.split(',')

['a', 'b', ' c']

In [153]:
' c'.strip()

'c'

In [154]:
[x.strip() for x in val.split(',')]

['a', 'b', 'c']

In [155]:
'::'.join([x.strip() for x in val.split(',')])

'a::b::c'

### regular expressions（正则表达式）

In [156]:
import re
text = 'foo     bar\t baz  \tqux'
text

'foo     bar\t baz  \tqux'

In [157]:
re.split('\s+', text)  # the regex describing one or more whitespace characters is '\s+'

['foo', 'bar', 'baz', 'qux']